
fn main() {
    //* (1..10) or (1..=10)  
    //*รูปแบบ (Syntax),ความหมาย,ผลลัพธ์ (ค่าของ i)
    //* 1..10,Exclusive Range (ไม่รวมตัวสุดท้าย),"1, 2, 3, ..., 9 (จะหยุดก่อนถึง 10)"
    //* 1..=10,Inclusive Range (รวมตัวสุดท้าย),"1, 2, 3, ..., 10 (นับถึง 10 ด้วย)"
    // for i in 1..10 {
    //     println!("i = {}", i);
    // }
    // for i in 1..=10 {
    //     println!("i = {}", i);
    // }
    //* rev() ใช้กับ range เพื่อให้ loop ทำงานจากสุดท้ายไปยังตัวแรก 10 9 8 7 6 5 4 3 2 1
    // for i in (1..=10).rev() {
    //     println!("i = {}", i);
    // }

    //* นับถอยหลังทีละ 2 ตัว  .step_by(2): หยิบข้อมูลมา ทีละ 2 (เอาตัวแรก, ข้ามตัวถัดไป, เอาตัวถัดไป...)
    for i in (1..=10).rev().step_by(2) {
        println!("i = {}", i);
    }
}