// Variants  คือ ตัวเลือกย่อย หรือ สมาชิก ที่อยู่ใน Enum 

// เปรียบเทียบกับกาแฟ 
// ความสัมพันธ์ระหว่าง Enum กับ Variants 
// Enum คือ ป้ายเมนูหลัก ที่แปะอยู่หน้าร้าน ส่วน Variants คือ รายการเครื่องดื่มแต่ละชนิด ที่อยู่บนป้ายนั้น

// สร้างเมนู (Enum)
enum CoffeeMenu {
    // Variant ที่ 1: สั่งง่ายๆ จบในตัว
    Americano, 

    // Variant ที่ 2: สั่งแล้วต้องจด "ชนิดนม" (เป็นข้อความ)
    Latte(String), 

    // Variant ที่ 3: สั่งแล้วต้องจด "ความหวาน" (เป็นตัวเลข)
    Mocha(i32),
}

fn main() {
    // --- ลูกค้าคนที่ 1: สั่งอเมริกาโน่ ---
    // เลือก Variant "Americano" (ไม่ต้องใส่วงเล็บอะไรเพิ่ม)
    let order1 = CoffeeMenu::Americano;


    // --- ลูกค้าคนที่ 2: สั่งลาเต้ ---
    // เลือก Variant "Latte" -> ต้องใส่ข้อมูล "นมโอ๊ต" เข้าไปในกล่อง
    let order2 = CoffeeMenu::Latte(String::from("นมโอ๊ต"));


    // --- ลูกค้าคนที่ 3: สั่งมอคค่า ---
    // เลือก Variant "Mocha" -> ต้องใส่เลข "50" (หวาน 50%) เข้าไป
    let order3 = CoffeeMenu::Mocha(50);
}
  
