// Enums ย่อมาจาก Enumeration 

// สัญญาณไฟจราจร 

// ปัญหาของการไม่ใช้ Enums (ใช้ตัวแปรปกติ)
// ถ้าเราใส่ 4 หรือ 100 เข้าไปในระบบ...

// ผลลัพธ์: โปรแกรมงง ไฟจราจรดับ หรือระเบิด เพราะมันไม่รู้จักเลข 4

// Enums ช่วยได้ เพราะมันบอกได้ชัดเจนว่า "นี่มันไฟจราจรดับ หรือ เขียว หรือว่า เหลือง

// สร้าง Enums ชื่อ TrafficLight
enum TrafficLight {
    Red,    // แดง
    Yellow, // เหลือง
    Green,  // เขียว
}
//  จะมีไฟแค่ 3 สีนี้เท่านั้น ไม่มีสีม่วง ไม่มีสีเบอร์ 4
//  นอกเหนือจากที่กำหนดไว้ใน Enums จะไม่มีสีอื่นๆ เลย

// ความพิเศษของ Enums ใน Rust (ที่เจ๋งกว่าภาษาอื่น)
// กล่องพัสดุที่ระบุประเภท ซึ่งข้างในกล่อง ยัดของใส่ลงไปได้ด้วย

enum Payment {
    Cash,                       // แบบที่ 1: จ่ายสด (กล่องเปล่า)
    CreditCard(String),         // แบบที่ 2: บัตร (ต้องแนบเลขบัตรมาด้วย)
    BankTransfer(u32, String),  // แบบที่ 3: โอน (แนบยอดเงิน + ชื่อธนาคาร)
}
// เวลาใช้
let my_pay = Payment::CreditCard(String::from("1234-5678"));


//สรุป Enums คืออะไร? 
// คือเมนูตัวเลือก ที่บังคับว่าต้องเลือกตามที่กำหนดเท่านั้น (ห้ามนอกลู่นอกทาง)
// คือความปลอดภัย: ช่วยป้องกันการกรอกข้อมูลมั่วๆ (เช่น สถานะออเดอร์มีแค่ รอส่ง กับ ส่งแล้ว จะมาพิมพ์ ส่งแย้วจ้า ไม่ได้)
// คือกล่องเก็บข้อมูล (เฉพาะ Rust) แต่ละตัวเลือก สามารถห่อข้อมูลที่เกี่ยวข้องติดตัวไปด้วยได้




