// Defining Enums คือ การกำหนดชนิดข้อมูลที่สามารถเลือกได้
// เหมือนเจ้าของร้านกาแฟ พิมพ์เมนูแปะผนัง ว่าร้านเราขายอะไรบ้าง
// using การใช้งาน เหมือนลูกค้าเดินมาชี้ที่เมนูว่า เอาอันนี้

// แบบที่ 1: เมนูธรรมดา (Classic)
//แค่บอกชื่อตัวเลือกเฉยๆ ไม่ต้องมีรายละเอียดอะไร

// 1. ใช้คำว่า enum
// 2. ตั้งชื่อ (นิยมขึ้นต้นตัวใหญ่ - PascalCase)
enum CoffeeMenu {
    Espresso,   // ตัวเลือกที่ 1
    Latte,      // ตัวเลือกที่ 2
    Mocha,      // ตัวเลือกที่ 3
}


// แบบที่ 2 เมนูที่จดรายละเอียดเพิ่มได้  ต้องแปะป้ายบอก Rust ว่า "Enum นี้ปรินท์ออกหน้าจอได้นะ
#[derive(Debug)]
enum CoffeeMenu {
    Espresso(String),   // ตัวเลือกที่ 1
    Latte(String),      // ตัวเลือกที่ 2
    Mocha(String),      // ตัวเลือกที่ 3
}


//วิธีการเรียกใช้ (เมื่อสร้างเสร็จแล้ว)
//เราจะใช้เครื่องหมาย :: (Double Colon) เพื่อเข้าไปเลือกช้อยส์ข้างในครับ

fn main() {
    //  ข้อมูลที่ใส่ ต้องแปลงเป็น String (กล่อง) ก่อน
    // เพราะ "..." เฉยๆ ใน Rust ถือเป็นกระดาษแผ่นบางๆ (&str) ไม่ใช่ String
    let my_coffee = CoffeeMenu::Espresso(String::from("เข้มข้น")); 
    println!("ฉันสั่งกาแฟ: {:?}", my_coffee);
}