// Adding elements คือ การเติมของเข้าตู้

fn adding_push() {
    // 1. สร้างแถวว่างๆ (ต้องมี mut เพื่อให้แถวขยับได้)
    let mut numbers = Vec::new();
    // ตอนนี้: [] (ว่างเปล่า)

    // 2. คนแรกมา (เลข 5)
    numbers.push(5);
    // ตอนนี้: [5]

    // 3. คนที่สองมา (เลข 6) -> ต่อท้าย 5
    numbers.push(6);
    // ตอนนี้: [5, 6]

    // 4. คนที่สามมา (เลข 7) -> ต่อท้าย 6
    numbers.push(7);
    // ตอนนี้: [5, 6, 7]
    
    // 5. คนที่สี่มา (เลข 8) -> ต่อท้าย 7
    numbers.push(8);
    // ตอนนี้: [5, 6, 7, 8]
}

// ต้องมี mut: ถ้าตอนสร้าง Vector ลืมใส่ mut คุณจะไม่มีสิทธิ์ใช้คำสั่ง .push() (เหมือนร้านปิดรับคิว)

//เข้าข้างหลังเสมอ: คำสั่ง .push() จะเอาของไปวางไว้ ตำแหน่งสุดท้าย เสมอ

//ชนิดต้องเหมือนเดิม: ถ้าคนแรกเป็นตัวเลข คนต่อๆ ไปก็ต้องเป็นตัวเลข (ห้ามเอาตัวหนังสือมาเนียนต่อแถว)


// insert ขอแทรกตรงนี้หน่อยนะ คนข้างหลังขยับไปหน่อย
// ข้อเสียคือคอมพิวเตอร์ต้องขยับของตัวหลังๆ ถอยไป 1 ช่องทั้งหมด

fn adding_insert() {
    let mut v = vec![10, 20, 30];
    // ตอนนี้: [10, 20, 30]

    // สั่งแทรกเลข 99 ที่ช่องเบอร์ 1
    v.insert(1, 99); 
    
    // ผลลัพธ์: [10, 99, 20, 30]
    // สังเกตว่า 20 กับ 30 ต้องขยับหนีไปข้างหลัง
}


//extend มี Vector หลักอยู่ แล้วอยากเอา "ชุดข้อมูลอื่น" (อาจจะเป็น Array หรือ Vector อื่นก็ได้) มาต่อท้ายทีเดียวหลายๆ ตัว โดยการ ก๊อปปี้ หรือดึงค่ามา
//เหมือนคุณ "เอาเงินมารวมกัน" ในกระเป๋า หรือ "เอาผลไม้มารวมกัน" ในตะกร้า

fn adding_extend() {
    let mut v = vec![1, 2];
    let more_data = [3, 4, 5]; // ข้อมูลชุดใหม่ (Array)

    // สั่ง extend: เอา 3, 4, 5 มาต่อท้าย v
    v.extend(more_data);

    // ผลลัพธ์: [1, 2, 3, 4, 5]
    // ตัว more_data ยังอยู่ดีมีสุข เพราะแค่ก๊อปค่ามา (กรณีเป็น Primitive type)
}

// append เทถุง B ใส่ถุง A (ถุง B จะว่างเปล่าทันที)
//ย้ายของ (Move) จาก Vector อีกอันมาใส่เลย มันไม่ได้ก๊อปปี้ แต่เป็นการ ย้ายประชากร ทั้งหมดมา

fn adding_append() {
    let mut v1 = vec![1, 2];      // ถุง A
    let mut v2 = vec![3, 4, 5];   // ถุง B

    // สั่ง append: เทของใน v2 ใส่ v1
    v1.append(&mut v2);

    // ผลลัพธ์ v1: [1, 2, 3, 4, 5]  <-- ของมารวมที่นี่หมด
    // ผลลัพธ์ v2: []               <-- ว่างเปล่า! (เพราะโดนเทหมดแล้ว)
}


