// Vector คือ รายการข้อมูลที่สามารถเปลี่ยนแปลงขนาดได้

//ใส่ของได้หลายชิ้น (แต่ต้องเป็นของประเภทเดียวกัน เช่น แอปเปิ้ลทั้งหมด หรือส้มทั้งหมด)
//ขยายได้ - อยากใส่เพิ่มก็ใส่ได้เรื่อยๆ
//หดได้ - เอาของออกก็ได้
//มีลำดับ - ของชิ้นแรก ชิ้นที่สอง ชิ้นที่สาม... เรียงกันไปเรื่อยๆ

fn main() {
    // 1. สร้าง Vector ว่างๆ ขึ้นมา (เหมือนเตรียมกล่องเปล่า)
    // keyword "mut" บอกว่ากล่องนี้ "เปลี่ยนแปลงขนาดได้" นะ
    let mut fruits = Vec::new();

    // 2. ใส่ของเพิ่ม (ขยายได้)
    fruits.push("แอปเปิ้ล"); // ใส่ลูกที่ 1
    fruits.push("ส้ม");      // ใส่ลูกที่ 2
    fruits.push("กล้วย");    // ใส่ลูกที่ 3

    // 3. ของต้องประเภทเดียวกัน
    // fruits.push(100);  <-- บรรทัดนี้จะ Error ทันที! เพราะเราตกลงกันแล้วว่าเป็นกล่องใส่ชื่อผลไม้ (ตัวหนังสือ)

    // 4. เอาของออก (หดได้)
    fruits.pop(); // สั่งคำสั่งนี้ "กล้วย" (ตัวสุดท้าย) จะหายไป กล่องจะหดลง

    // 5. มีลำดับ
    // ถ้าเราเรียกดูตัวที่ 0 ก็จะได้ "แอปเปิ้ล"
    println!("ผลไม้ลูกแรกคือ: {}", fruits[0]);
}


// จะมีคำว่า ownership และ modifiable ใน Vector
// Ownership (ความเป็นเจ้าของ) ใน Vector

//เมื่อคุณสร้าง Vector (let mut fruits = Vec::new()) = คุณเป็นเจ้าของกล่อง
//เมื่อคุณใส่ของลงกล่อง (fruits.push("แอปเปิ้ล")) = ของนั้นเป็นของกล่อง (Vector)
//เมื่อ Vector หายไป (จบฟังก์ชัน) = ของในกล่องก็หายไปด้วย


// Modifiable (เปลี่ยนแปลงได้) ใน Vector

// 1. แบบปกติ (Immutable - แก้ไขไม่ได้)
// let fruits = Vec::new();
// เปรียบเหมือน: "ตู้โชว์กระจกที่ล็อกกุญแจ"
// - คุณเป็นเจ้าของตู้ (Ownership)
// - มองเห็นของข้างในได้ (Read)
// - แต่ห้ามหยิบออก ห้ามใส่เพิ่ม (Write/Edit = ทำไม่ได้!)

// 2. แบบเปลี่ยนแปลงได้ (Mutable - ต้องใส่คำว่า mut)
// let mut fruits = Vec::new();
// เปรียบเหมือน: "กล่องลังที่เปิดฝาไว้"
// - คุณเป็นเจ้าของกล่อง (Ownership)
// - มองเห็นของข้างในได้ (Read)
// - หยิบของเก่าออกได้ ใส่ของใหม่เพิ่มได้ (Write/Edit = ทำได้!)



