// Modifiable แบบที่แก้ไม่ได้ และ แบบที่แก้ได้

// แบบแก้ไม่ได้ (Immutable) 

// เปรียบเหมือน "ตู้โชว์กระจกที่ล็อกกุญแจ"

fn main() {
    // ประกาศแบบธรรมดา (ไม่มีคำว่า mut)
    let colors = vec!["แดง", "เขียว"]; 

    println!("ดูสี: {:?}", colors); // อ่านได้ (Read) - ผ่านฉลุย

    // --- จุดที่จะ Error ---
    // colors.push("น้ำเงิน"); //  พยายามใส่เพิ่ม -> คอมพิวเตอร์จะด่าทันที!
    // colors[0] = "ดำ";      //  พยายามแก้ค่าตัวแรก -> ก็ด่าเหมือนกัน!
}

// แบบแก้ได้ (Mutable) 
// กระดานไวท์บอร์ด (เขียนเพิ่มได้ ลบได้ แก้คำผิดได้)
// ต้องเติม mut (ย่อมาจาก Mutable) เพื่อบอก Rust ว่า "กล่องนี้ฉันขออนุญาตแก้นะ"
fn main() {
    // ใส่คำว่า mut เพื่อปลดล็อก
    let mut scores = vec![10, 20, 30];

    // 1. เพิ่มของ (Add)
    scores.push(40); 
    // ตอนนี้เป็น: [10, 20, 30, 40]

    // 2. แก้ไขค่าเดิม (Update)
    scores[0] = 99;  // เปลี่ยนตัวแรกจาก 10 เป็น 99
    // ตอนนี้เป็น: [99, 20, 30, 40]

    // 3. ลบของออก (Remove)
    scores.pop();    // เอาตัวสุดท้าย (40) ออก
    // ตอนนี้เป็น: [99, 20, 30]

    println!("คะแนนล่าสุด: {:?}", scores);
}


// ไม่อยากแก้ ใส่ let 
// อยากแก้ ใส่ let mut

