fn main() {
     // เอาข้อความ "The Stack Dev"มาทำเป็น สมุดจด (String) แล้วตั้งชื่อสมุดว่า sentence
    // .to_string() คือการขอเบิกงบ (Memory Heap) เพื่อสร้างสมุดเล่มใหม่ที่เป็นของเราเอง
     let sentence = "The Stack Dev".to_string();

     // การ Slice (หั่น/มอง)
    // [0..4] คือระบุช่วง: เอาตั้งแต่ 0 แต่ไม่เอา 4 (ได้แก่ 0, 1, 2, 3 -> "T", "h", "e", " ")
    //ทำไมต้องมี &  เรา ไม่ได้ตัดสมุดออกมาเป็นเล่มใหม่ แค่ ชี้ไปดูบางหน้าของสมุด
    let slice = &sentence[0..4];

    println!("Full: {}", sentence); // สมุดเล่มเดิมยังอยู่ครบ ไม่เสียหาย
    println!("Slice: '{}'", slice); // ผลลัพธ์: 'The '
  
}