// เพื่อนคนที่ 1: "จอมยึดของ"
// ฟังก์ชันนี้ ถ้าส่งของให้ เขาจะเอาไปเลย (Move) ไม่คืนเราแล้วนะ
fn print_string(s: String) {
    println!("String: {}", s); 
    // จบฟังก์ชันนี้ ของที่ชื่อ s จะถูกทำลายทิ้งทันที
}

// เพื่อนคนที่ 2: "นักอ่านป้าย"
// ฟังก์ชันนี้ แค่ขอ "มองดู" (Borrow) เท่านั้น ไม่ได้เอาของไป
fn print_str(s: &str){
    println!("Str: {}", s);
}

fn main() {
    // 1. สร้างกล่องของขวัญส่วนตัว (String)
    // เป็นสมุดจดที่เราเป็นเจ้าของ แก้ไขได้
    let mut salutation = String::from("Hello String");

    // 2. ยื่นกล่องให้เพื่อนคนที่ 1
    // ระวัง! บรรทัดนี้คือการ "ยกให้เลย" (Move ownership)
    print_string(salutation); 
    
    // ถ้าคุณแอบเขียนโค้ดบรรทัดข้างล่างนี้ คอมจะด่าทันที 
    // เพราะกล่อง salutation ไม่อยู่กับเราแล้ว (เพื่อนเอาไปแล้ว)
    // print_string(salutation); // <--- Error!


    // 3. ป้ายข้อความติดผนัง (&str)
    // อันนี้เป็นข้อความตายตัว แก้ไม่ได้ แปะอยู่กับที่
    let s = "Hellow str";

    // 4. ชี้ให้เพื่อนคนที่ 2 ดู
    // แค่ชี้ให้ดูเฉยๆ ป้าย s ยังอยู่ที่เดิม ไม่ได้หายไปไหน
    print_str(s);
    
    // ถ้าจะชี้ให้ดูอีกรอบ ก็ทำได้ เพราะของยังอยู่
    print_str(s); 
}