// Error Handling (การจัดการข้อผิดพลาด)
// คือวิธีที่โปรแกรมรับมือกับปัญหาที่อาจเกิดขึ้นระหว่างการทำงาน

// โปรแกรมจริง ๆ ไม่ได้รันราบรื่นตลอด
// ข้อมูลอาจผิด ไฟล์อาจหาย ผู้ใช้อาจใส่ค่าผิด

// Rust จึงมีวิธีจัดการ error อยู่ 2 แนวคิดหลัก

// Stop a program (panic!) 
// หยุดโปรแกรมทันที เมื่อเกิดข้อผิดพลาดร้ายแรง
// เป็น bug
// เป็นสิ่งที่ ไม่ควรเกิดขึ้นเลย
// ถ้าฝันรันต่อ โปรแกรมอาจพังหนักกว่าเดิม
// ตัวอย่าง: รถเบรกแตก → ต้องหยุดรถทันที



// Handle error (Result + match)
// แนวคิด
// เจอปัญหาแล้ว…รับมือให้ได้ แล้วทำงานต่อ
// เป็น error ที่คาดเดาได้
// เกิดจากผู้ใช้ หรือข้อมูลภายนอก
// โปรแกรมยังไปต่อได้
// ตัวอย่าง: กดรหัสผิด → แจ้งเตือน แล้วให้ลองใหม่



